In [10]:
%matplotlib inline
import pandas as pd
import numpy as np
import requests
print('done!')

done!

In [11]:
data_url = 'https://s3.amazonaws.com/labour-statistics-dataset/cd/cd.series.gz'
r = requests.get(data_url)

In [13]:

col_dtypes = {'age_code':'object', 'los_code':'object', 'race':'object'}
data_url = 'https://s3.amazonaws.com/labour-statistics-dataset/cd/cd.series.gz'

injuries = pd.read_table(data_url, dtype=col_dtypes, compression='gzip', low_memory=False)

print(injuries.shape)

injuries.head()

(392589, 19)

,series_id,category_code,datatype_code,case_code,age_code,los_code,race_code,gender_code,pob_code,event_code,source_code,occupation_code,nature_code,industry_code,footnote_code,begin_year,begin_period,end_year,end_period
0,CDU00000033,00,3,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0000,,1992,A01,2001,A01
1,CDU0000003E,00,3,E,NaN,NaN,NaN,NaN,NaN,0000,NaN,NaN,NaN,NaN,,1992,A01,2001,A01
2,CDU0000003N,00,3,N,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0000,NaN,,1992,A01,2001,A01
3,CDU0000003P,00,3,P,NaN,NaN,NaN,NaN,0000,NaN,NaN,NaN,NaN,NaN,,1992,A01,2001,A01
4,CDU0000003S,00,3,S,NaN,NaN,NaN,NaN,NaN,NaN,0000,NaN,NaN,NaN,,1992,A01,2001,A01

In [7]:

pd.read_table('https://s3.amazonaws.com/labour-statistics-dataset/cd/cd.race.gz', compression='gzip')

  race_code                          race_text
0      0000                          All races
1      1XXX                White, non-Hispanic
2      2XXX                Black, non-Hispanic
3      3XXX                           Hispanic
4      4XXX          Asian or Pacific Islander
5      5XXX  American Indian or Alaskan Native
6      NRXX                       Not reported

In [9]:

pd.read_table('https://s3.amazonaws.com/labour-statistics-dataset/cd/cd.age.gz', compression='gzip')

  age_code     age_text
0     0000  All workers
1     14XX     Under 14
2     15XX      14 - 15
3     19XX      16 - 19
4     24XX      20 - 24
5     34XX      25 - 34
6     44XX      35 - 44
7     54XX      45 - 54
8     64XX      55 - 64
9     65XX  65 and over

In [6]:

pd.read_table('https://s3.amazonaws.com/labour-statistics-dataset/cd/cd.los.gz', compression='gzip')

  los_code            los_text
0     0000         All workers
1     1XXX  Less than 3 months
2     2XXX       3 - 11 months
3     3XXX         1 - 5 years
4     4XXX   More than 5 years
5     NRXX        Not reported

In [12]:
% pastebin "demo.ipynb"

'https://gist.github.com/0193c2c4cc54dbe1c9d2'